#include<stdio.h>

int main()
{
//1 2 3 4
//2 3 4 5
//3 4 5 6
    //二维数组的创建
    int arr[3][4];  //3行4列 
    char str[2][6];
    //二维数组初始化
    int arr1[3][4]={1,2,3,4,2,3,4,5,3,4,5,6};//3行4列 全部定义了
    int arr2[3][4]={1,2,3,4,2,3,4,5,3,4};//先拿四个给第一行，···第二行，第三行不够四个数，会默认补0
    int arr3[3][4] = {{1,2},{4,5},{1,1}};//1 2 0 0
                                        //4 5 0 0
                                        //1 1 0 0
    int arr4[][4] = {{1,2,2,3},{4,5}};   // 行可以省略，列不能省略 
    //二维数组可以理解成数组的数组，数组的集合

    //二维数组中的每个元素在内存中实际上也是连续存放的
    int i = 0;
    for(i=0; i<3; i++)
    {
        int j = 0;
        for(j=0; j<4; j++)
       {
            printf("&arr[%d][%d] = %p\n", i, j,&arr1[i][j]);
       }
    }
                           
    return 0;
}